; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	thermograph0 - mode
	infrared2 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph0)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(have_image Star10 thermograph0)
	(have_image Star11 infrared2)
	(have_image Star12 spectrograph1)
	(have_image Star13 image3)
	(have_image Planet14 image3)
))

)

; plan
1. (turn_to satellite0 groundstation1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   goals met: 0 of 5
5. (take_image satellite0 star11 instrument0 infrared2)
   added: (have_image star11 infrared2)
   goals met: 1 of 5
6. (turn_to satellite0 star10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star10)
   goals met: 1 of 5
7. (take_image satellite0 star10 instrument0 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 2 of 5
8. (turn_to satellite0 planet14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet14)
   goals met: 2 of 5
9. (take_image satellite0 planet14 instrument0 image3)
   added: (have_image planet14 image3)
   goals met: 3 of 5
10. (turn_to satellite0 star12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star12)
   goals met: 3 of 5
11. (take_image satellite0 star12 instrument0 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 4 of 5
12. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 4 of 5
13. (take_image satellite0 star13 instrument0 image3)
   added: (have_image star13 image3)
   goals met: 5 of 5
